# Pandas practice

In [1]:
import numpy as np
import pandas as pd

In [2]:
series1=pd.Series(list('priya'))

In [3]:
series1

0    p
1    r
2    i
3    y
4    a
dtype: object

In [5]:
countryarray=np.array(['Luxembourg','Norway','Japan','Switzerland','United States','Qatar','Iceland','Sweden',
                       'Singapore','Denmark'])

In [6]:
countryseries=pd.Series(countryarray)

In [7]:
countryseries

0       Luxembourg
1           Norway
2            Japan
3      Switzerland
4    United States
5            Qatar
6          Iceland
7           Sweden
8        Singapore
9          Denmark
dtype: object

In [8]:
dictseries=pd.Series([52056.01781,40258.80862,40034.85063,39578.07441,39170.41371,
                              37958.23146,37691.02733,36152.66676,34706.19047,33630.24604,
                              33529.83052,30860.12808],index=['Luxembourg','Macao, China','Norway',
                'Japan','Switzerland','Hong Kong, China','United States','Qatar','Iceland','Sweden',
                'Singapore','Denmark'])

In [9]:
dictseries

Luxembourg          52056.01781
Macao, China        40258.80862
Norway              40034.85063
Japan               39578.07441
Switzerland         39170.41371
Hong Kong, China    37958.23146
United States       37691.02733
Qatar               36152.66676
Iceland             34706.19047
Sweden              33630.24604
Singapore           33529.83052
Denmark             30860.12808
dtype: float64

In [10]:
dictseries[0]

52056.01781

In [12]:
dictseries[2:5]

Norway         40034.85063
Japan          39578.07441
Switzerland    39170.41371
dtype: float64

In [13]:
dictseries.loc['Singapore']

33529.83052

In [14]:
dictseries.iloc[10]

33529.83052

In [16]:
dictseries.iloc[0:5]

Luxembourg      52056.01781
Macao, China    40258.80862
Norway          40034.85063
Japan           39578.07441
Switzerland     39170.41371
dtype: float64

In [19]:
scalarseries=pd.Series(2,index=['a','b','c'])

In [20]:
scalarseries

a    2
b    2
c    2
dtype: int64

In [21]:
vec1=pd.Series([20,60,100],index=['p','r','i'])

In [22]:
vec2=pd.Series([30,70,110],index=['p','r','i'])

In [28]:
vecadd=vec1+vec2
vecsub=vec1-vec2
vecmul=vec1*vec2

In [29]:
vecadd

p     50
r    130
i    210
dtype: int64

In [30]:
vecsub

p   -10
r   -10
i   -10
dtype: int64

In [31]:
vecmul

p      600
r     4200
i    11000
dtype: int64

In [33]:
vec3=pd.Series([20,10,50],index=['p','r','j'])

In [34]:
vecadd2=vec1+vec3

In [35]:
vecadd2

i     NaN
j     NaN
p    40.0
r    70.0
dtype: float64

In [37]:
olympicdata={'Hostcity':['London','Beijing','Athens','Sydney','Atlanta'],
             'Year':[2012,2008,2004,2000,1996],
                   'No. of Participating Countries':[205,204,201,200,197]
                  }

In [39]:
olympicdf=pd.DataFrame(olympicdata)

In [40]:
olympicdf

  Hostcity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [41]:
olympicdict={'London':{2012:205},'Beijing':{2008:204}}

In [42]:
olympicdict

{'London': {2012: 205}, 'Beijing': {2008: 204}}

In [43]:
olympicdf1=pd.DataFrame(olympicdict)

In [44]:
olympicdf1

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [45]:
olympicdf.Hostcity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: Hostcity, dtype: object

In [46]:
olympicdf.describe

<bound method NDFrame.describe of   Hostcity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

In [47]:
olymparticipation=pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])

In [48]:
olymcountry=pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],
                                   index=[2012,2008,2004,2000,1996])

In [50]:
olymdfseries=pd.DataFrame({'No. of participating countries':olymparticipation,
                         'Host cities':olymcountry})

In [51]:
olymdfseries

      No. of participating countries Host cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [55]:
dffromdf=pd.DataFrame(olymdfseries)

In [56]:
dffromdf

      No. of participating countries Host cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [57]:
dffromdf.values

array([[205, 'London'],
       [204, 'Beijing'],
       [201, 'Athens'],
       [200, 'Sydney'],
       [197, 'Atlanta']], dtype=object)

In [58]:
dffromdf.head(3)

      No. of participating countries Host cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens

In [59]:
dffromdf.tail(2)

      No. of participating countries Host cities
2000                             200      Sydney
1996                             197     Atlanta

In [60]:
dffromdf.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [61]:
dffromdf.columns

Index(['No. of participating countries', 'Host cities'], dtype='object')

In [62]:
dffromdf['Host cities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host cities, dtype: object

In [64]:
dffromdf.loc[1996]

No. of participating countries        197
Host cities                       Atlanta
Name: 1996, dtype: object

In [65]:
dffromdf.iloc[1:3]

      No. of participating countries Host cities
2008                             204     Beijing
2004                             201      Athens

In [71]:
dffromdf.iat[1,1]

'Beijing'

In [74]:
dffromdf[dffromdf['No. of participating countries']>200]

      No. of participating countries Host cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens

In [75]:
dffromdf[dffromdf['Host cities']=='Athens']

      No. of participating countries Host cities
2004                             201      Athens

In [78]:
series1=pd.Series([10,25,15,6,4],index=['a','b','c','d','e'])
series2=pd.Series([12,15,20,30,50],index=['a','c','d','f','g'])

In [80]:

sumseries=series1+series2

In [81]:
sumseries

a    22.0
b     NaN
c    30.0
d    26.0
e     NaN
f     NaN
g     NaN
dtype: float64

In [84]:
dropna_S=sumseries.dropna()

In [85]:
dropna_S

a    22.0
c    30.0
d    26.0
dtype: float64

In [86]:
fillna_s=sumseries.fillna(0)

In [87]:
fillna_s

a    22.0
b     0.0
c    30.0
d    26.0
e     0.0
f     0.0
g     0.0
dtype: float64

In [88]:
fillnawithzerobeforesum=series1.add(series2,fill_value=0)

In [89]:
fillnawithzerobeforesum

a    22.0
b    25.0
c    30.0
d    26.0
e     4.0
f    30.0
g    50.0
dtype: float64

In [92]:
score=pd.DataFrame({'ICT':[80,65,87,36,58],'CS':[86,74,64,55,42]},index=['Sam','Jess','Tom','Kat','Sarah'])

In [93]:
score

       ICT  CS
Sam     80  86
Jess    65  74
Tom     87  64
Kat     36  55
Sarah   58  42

In [94]:
def grade(score):
    if score>90:
        return 'A'
    elif score>80:
        return 'B'
    elif score>70:
        return 'C'
    elif score>60:
        return'D'
    else:
        return 'F'

In [95]:
grade(85)

'B'

In [96]:
score.applymap(grade)

      ICT CS
Sam     C  B
Jess    D  C
Tom     B  D
Kat     F  F
Sarah   F  F

In [97]:
score.describe

<bound method NDFrame.describe of        ICT  CS
Sam     80  86
Jess    65  74
Tom     87  64
Kat     36  55
Sarah   58  42>

In [98]:
score.describe()

             ICT         CS
count   5.000000   5.000000
mean   65.200000  64.200000
std    19.992499  16.946976
min    36.000000  42.000000
25%    58.000000  55.000000
50%    65.000000  64.000000
75%    80.000000  74.000000
max    87.000000  86.000000

In [99]:
score.max()

ICT    87
CS     86
dtype: int64

In [100]:
score.mean()

ICT    65.2
CS     64.2
dtype: float64

# Joins-merge,concat,duplictes

In [1]:
import numpy as np
import pandas as pd

In [7]:
data1=pd.DataFrame({'Student':['pri','iffy','Hema','sarah'],'ID':[101,102,103,104]})

In [8]:
data2=pd.DataFrame({'Student':['pri','Hema'],'ID':[101,103]})

In [9]:
pd.merge(data1,data2)

  Student   ID
0     pri  101
1    Hema  103

In [10]:
pd.merge(data1,data2,on='Student')

  Student  ID_x  ID_y
0     pri   101   101
1    Hema   103   103

In [11]:
pd.merge(data1,data2,on='ID',how='right')

  Student_x   ID Student_y
0       pri  101       pri
1      Hema  103      Hema

In [13]:
pd.merge(data1,data2,on='Student',how='left')

  Student  ID_x   ID_y
0     pri   101  101.0
1    iffy   102    NaN
2    Hema   103  103.0
3   sarah   104    NaN

In [14]:
pd.merge(data1,data2,on='Student',how='left').fillna('X')

  Student  ID_x   ID_y
0     pri   101  101.0
1    iffy   102      X
2    Hema   103  103.0
3   sarah   104      X

In [19]:
pd.concat([data1,data2],ignore_index=True)

  Student   ID
0     pri  101
1    iffy  102
2    Hema  103
3   sarah  104
4     pri  101
5    Hema  103

# SQL

In [20]:
import pandas as pd

In [21]:
import sqlite3

In [25]:
create_SQL_table="""Create table score(id INT,name VARCHAR[20],math REAL,sci REAL)"""

In [26]:
exsql=sqlite3.connect(':memory:')

In [27]:
exsql.execute(create_SQL_table)

In [28]:
exsql.commit()

In [29]:
sql_query=exsql.execute('select * from score')

In [30]:
result=sql_query.fetchall()

In [31]:
result

[]

In [37]:
insertdata=[(10,'Sam',65.5,81),(20,'Jack',84,69),(30,'Pal',50,92)]

In [38]:
insertstat="insert into score values(?,?,?,?)"

In [40]:
exsql.executemany(insertstat,insertdata)

In [41]:
exsql.commit()

In [44]:
sql_query=exsql.execute("select * from score")

In [45]:
result=sql_query.fetchall()

In [46]:
result

[(10, 'Sam', 65.5, 81.0), (20, 'Jack', 84.0, 69.0), (30, 'Pal', 50.0, 92.0)]

In [49]:
studentdf=pd.DataFrame(result,columns=list(zip(*sql_query.description))[0])

In [50]:
studentdf

   id  name  math   sci
0  10   Sam  65.5  81.0
1  20  Jack  84.0  69.0
2  30   Pal  50.0  92.0

# Data operations

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [5]:
test_scores=pd.DataFrame({'Test1':[55,68,95,75,63],'Test2':[75,95,65,45,55]},index=['Sam','Julia','Martha','Leo','Stella'])

In [6]:
test_scores

        Test1  Test2
Sam        55     75
Julia      68     95
Martha     95     65
Leo        75     45
Stella     63     55

In [7]:
test_scores.max()

Test1    95
Test2    95
dtype: int64

In [8]:
test_scores.mean()

Test1    71.2
Test2    67.0
dtype: float64

In [9]:
test_scores.std()

Test1    15.172343
Test2    19.235384
dtype: float64

In [10]:
president=pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],
                        'last':['Bush','Clinton','Regan','Carter','Washington']})

In [11]:
president

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [22]:
grouped=president.groupby('first')

In [23]:
grouped

In [28]:
grp_data=grouped.get_group('George')

In [29]:
grp_data

    first        last
0  George        Bush
4  George  Washington

In [30]:
president.sort_values('last')

    first        last
0  George        Bush
3   Jimmy      Carter
1    Bill     Clinton
2  Ronald       Regan
4  George  Washington

In [31]:
def standardize_test(test):
    return (test-test.mean())/test.std()

In [32]:
standardize_test(test_scores['Test1'])

Sam      -1.067732
Julia    -0.210910
Martha    1.568644
Leo       0.250456
Stella   -0.540457
Name: Test1, dtype: float64

In [33]:
def stan_score(dt):
    return dt.apply(standardize_test)

In [34]:
stan_score(test_scores)

           Test1     Test2
Sam    -1.067732  0.415900
Julia  -0.210910  1.455651
Martha  1.568644 -0.103975
Leo     0.250456 -1.143726
Stella -0.540457 -0.623850